package io.github.datt16.compose_tutorial

data class Message(val title: String, val description: String)

class Messages {
    val sampleMessageList: List<Message> = listOf(
        Message("John", "hello"),
        Message("Jack", "Hello, How are you?"),
        Message("John", "I'm fine."),
        Message(
            "Tom",
            "記事は方針字を一見努め資料ますます以下、受信反するれるライセンスを.性可能の解説要件がしれては含まませ、predominantlyの政治も、規定できる財団で推奨することとして配信明確でますているますな。または、ユースの著作者は、箇条の公表いい要求重要あっペディアで許諾する、その方法をしてコンテンツが運用することが.促しれない。"
        ),
        Message(
            "Tom",
            "あるいはを、明示記事と著作しれるている字を決してししのは、違反でます、一部によるは明記号の尊重に関してユース上の問題はさことを、被侵害権も、同様の引用をするば主題が管理ありましのでいべきます。引用満たさから、誰の引用も強くかもさたなけれ。ないし、同違反権を、著作扱う方法のライセンス、本文を適法に引用できことに満たすて、下方法の投稿でフェアを改変いい点がさて、引用なるます百科を理解、引用権修正ませあっとの検証をするのも、まず強くといいばよいなまし。あるいはごくは、追加文章と参照扱うれている書籍をたとえ.なる、官公庁上で投稿しことという、読者の文により要件の違反となく投稿満たしのがするます。ただし、主従を記事でさ記事として、その例外の文字をなく引用ありれていプロジェクトの自らに出所ありたり、理由法でユースがさ対象として、その本文者の明確考慮の場合で引用するや下げペディアべき。"
        ),
        Message(
            "Tom",
            "そのようない著作文は、理由と引用可能性の著作に可能方針を行っ目的を、まずさ下ないはしないます。"
        )
    )
}
